# Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.
empty_perem = []
if empty_perem:
    print('True')
else:
    print('False')
# В списке ничего нет, поэтому он является пустым.
