#Даны 2 действительных числа a и b. Получить их сумму, разность и произведение
a = 2
b = 3
sum = a + b
diff = a - b
mult = a * b
print(sum)
print(diff)
print(mult)
