#Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности
L = 4
V = L ** 3
print(V)
S = 4 * L **2
print(S)