#Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел
a = 2
b = 4
average1 = (a + b) / 2
print(average1)
average2 = (a * b) ** 0.5
print(average2)
